{"events_preview": [{"id": 0, "date_str": "2025-03-19", "date_obj_str": "2025-03-19T09:00:00", "date_formatted": "2025-03-19T09:00", "confidence": 0.9, "title": "Class Presentation", "full_description": "", "description": ""}, {"id": 1, "date_str": "2025-03-19", "date_obj_str": "2025-03-19T09:00:00", "date_formatted": "2025-03-19T09:00", "confidence": 0.9, "title": "Exam #1", "full_description": "", "description": ""}, {"id": 2, "date_str": "2025-04-02", "date_obj_str": "2025-04-02T09:00:00", "date_formatted": "2025-04-02T09:00", "confidence": 0.9, "title": "Exam #2", "full_description": "", "description": ""}, {"id": 3, "date_str": "2025-04-09", "date_obj_str": "2025-04-09T09:00:00", "date_formatted": "2025-04-09T09:00", "confidence": 0.9, "title": "Exam #3", "full_description": "", "description": ""}, {"id": 4, "date_str": "2025-04-09", "date_obj_str": "2025-04-09T09:00:00", "date_formatted": "2025-04-09T09:00", "confidence": 0.9, "title": "Personal Strategy Paper", "full_description": "", "description": ""}, {"id": 5, "date_str": "2025-04-09", "date_obj_str": "2025-04-09T09:00:00", "date_formatted": "2025-04-09T09:00", "confidence": 0.9, "title": "Participation", "full_description": "", "description": ""}], "document_text": " \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025  MMgmt    |    1 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n  \n \n \n \n \n \nSGMA 672, L01 & L02  \nStrategic Analysis  \n \nCourse Outline  Part A  – Winter 2025 term, Q4 , Session 5 of MMgmt program  \n \n \nInstructor  Astrid Eckstein  \nEmail  astrid.eckstein@ ucalgary.ca  \nOffice hours  Email to request an appointment  \nWebsite  http://d2l.ucalgary.ca  \nLecture location  MTH445  \nLecture times  Lecture 01 W ednesday,  9:00 am to 1 1:50 am  \nLecture 02 Wednesday, 2:00 pm to 4:50 pm  \nPrerequisites/Corequisites:  Admission to the Master of Management program  \n \n \nCourse \nDescription  Introduction to the key concepts, tools, and principles of strategy formulation and \ncompetitive analysis. This includes:  \n• What is strategy?  \n• Managing the strategy process.  \n• Analysing the external environment, understanding the opportunities and \nthreats.  \n• Evaluating the internal environment, capitalizing on strengths, managing \nweaknesses . \n• Business models, creating the competitive advantage.   \nCourse Objectives  \n By the end of the course, students will be able to:  \n1. Explain the role of strategic leaders and what they do;  \n2. Define strategy and explain how firms use strategy effectively by combining \ndifferent resources and capabilities and aligning with the external and internal \nenvironment;  \n3. Apply fundamental strategic management issues, concepts, and frameworks  \nto various business scenarios, evaluating the likely effectiveness of a given \nstrategy to create value ; \n4. Integrate problem -solving skills and knowledge gained from other courses in \n\n\n \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025 .   MMgmt    |    2 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n the business school curriculum and  explain how the various pieces of the \nbusiness puzzle fit together, and why different parts of business need to be \nmanaged in strategic harmony ;  \n5. Enhance their skills in the areas of oral and written communication, creative \nand logical decision -making, project planning and teamwork ; and   \n6. Create and assess their own personal strategy, determining how it can \nprovide a competitive advantage . \n \nNo matter what your background is, this course can be instrumental in helping you \nbecome a much savvier business person and prepare you for a successful business \ncareer. The problem -solving skills and holistic perspective that this course aims to \nhelp you develop will make you more marketable to prospective employers and help \nyou to plan your professional career in relation to the changing business environment.  \n \nTextbook and/or \nOther Materials \nand Resources  \n Required materials: Rothaermel, F. T. (2024 ). Strategic management , 6th ed. McGraw -\nHill. \nThe text comes with Connect.  \n \nAll other learning materials will be available through D2L.  \n \nThe use of generative AI tools is permitted as per the conditions stated in “Generative \nArtificial Intelligence (GAI) use in the course” following. Students must ensure proper \ncitation to avoid  academic penalty.   \nCourse Workload  \n \n Generally, it is understood that students should spend two hours per week outside of \nclass time for every hour of lecture. This means that for each course, students should \nexpect to spend approximately 9 hours per week total on course work and lectures. \nThis may vary by week depending on both the assessment schedule and on students’ \nability to manage their time.  \nGrade Scale  \n \n \n The Haskayne School of Business endeavours to ensure consistency of final grades \nacross courses and sections. Variations in distribution will always be considered by the \ninstructor where called for by the performance in each individual class. The student \ndoes not have any ‘right’ to a certain grade, but is responsible for earning grades. The \ninstructor has unfettered discretion to evaluate student performance and assign all \ngrades.  \n \n \n \n \n \n \n \n\n \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025 .   MMgmt    |    3 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n  \nGrade   Percentage \nScore  Grade \nPoint \nValue  Description  Notes:  \nA+ ≥ 95.0  4.0 Outstanding /exceptional \nperformance  Up to 20% of \nthe class  A ≥ 90.0  4.0 \nA- ≥ 85.0  3.7 Consistent, very high \nquality work  30-50% of the \nclass  \nB+ ≥ 80.0  3.3 Good performance  30-50% of the \nclass  B ≥ 75.0  3.0 Basic competence  \nB- ≥ \n70.0  2.7 Marginal performance, \ndefined as having gaps \nin basic competence  \nUp to 10% of \nthe class  C+ ≥ 65.0  2.3 \nAll grades below B - are \nindicative of failure at \nthe graduate level and \ncannot be counted \ntoward the course \nrequirements.  C ≥ 60.0  2.0 \nC- ≥ 55.0  1.7 \nD+ ≥ 52.0  1.3 \nD ≥ 50.0  1.0 \nF ≥ 0% 0 \nNote : See the “ Academic Standing ” section of the Faculty of Graduate Studies Calendar \nregarding grades less than B -. \n \nGrade \nDistribution  \n \n Due Date  Assessment  Group or \nIndividual  Weight  Course \nOutcomes \nAssessed  \nThroughout  Class Presentation  Group  20% 1, 2, 3, 4 , 5 \nMar. 19  Exam  #1 (in class)  Individual  20% 1, 2, 3, 4  \nApr. 2  Exam #2  (in class)  Individual  20% 1, 2, 3, 4  \nApr. 9  Exam #3  (in class)  Individual  10% 1, 2, 3, 4  \nApr. 9  Personal Strategy Paper  Individual  20% 6 \nThroughout, \nApr. 9 \nsubmission  Participation and \nContribution  Individual  10% 1, 2, 3, 4, 5 , \n6 \n Total   100%   \nSeveral of the deliverables for this class were a collaborative effort between \nProfessors Norm Althouse and Astrid Eckstein.  \nMissed \nAssessment Policy  Students must follow the guidelines outlined in Part B of the outline to request a \ndeferral for missed work during the term, including quizzes, assignments, and exams. \nTypically, deferrals are only granted in cases of illness, domestic affl iction, or religious \nconviction. If a deferral is granted, an instructor may require a make -up assessment to \n\n \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025 .   MMgmt    |    4 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n be completed or transfer the weight of the missed assessment to another assessment \nin the course.  \nLate Policy  Late assignments  will be subject to a penalty of 20% per  full or partial  day, including \nweekends and holidays. Note that an assignment submitted five or more days after \nthe due date will be assigned a grade of 0%.  \nClass \nPresentation  See Class Presentation Content tab on D2L, which includes all requirements for citing \nsources as well as formatting instructions. This group assignment  will be subject to a \npeer evaluation. If there are any groups with members who are not contributing, \nplease speak to the instructor as soon as possible. Do not wait. If students are not \ncontributing to their group, there is no alternative assignment for completion to \nreplace their part in the group work.  Students not contributing  at all  will receive 0%.  \nStudents contributing to a significantly lesser degree will have their individual grade \nadjusted accordingly.  \n20% of the final grade. Group assignment.  \nExams  There will be a total of 3 exams  throughout the semester, all scheduled during class \ntime. The exams will be taken online through D2L, and may include multiple choice , \nmultiple select, true/false, and/or short answer  questions covering various course \nmaterial. The questions will focus on material from the textbook and may include \nother activities covered  within class . While the exams will be “closed book,” students \nmay use a Reference Sheet for each exam. The Reference Sheet must be 8 ½” X 11” \nmaximum size, labelled with the student’s name , and filled in with handwritten (not \ntyped) information. It may be single or double sided. The instructor will be collecting \nall the “Reference Sheets” at the conclusion of each exam. More details can be found \non D2L.  \nExam #1  covers chapters 1 &2.  \n• 20% of the final grade. Individual assessment.  \n• Deferral date: To be determined.  \nExam #2  covers chapters 3&4.  \n• 20% of the final grade. Individual assessment.  \n• Deferral date: To be determined.  \nExam #3  covers chapter 5 . \n• 10% of the final grade. Individual assessment.  \n• Deferral date: To be determine d. \nPersonal Strategy  \nPaper  See Personal Strategy Paper Content tab on D2L. The personal strategy paper is a \nreflection regarding the skills you have learned/developed. It is also an opportunity to \narticulate your strategy for creating a personal competitive advantage.  \n20% of the final grade. Individual assessment.  \nClass \nParticipation  See Participation Content tab on D2L. Students are expected to contribute to the \nlearning of all classmates. This requires being engaged and engaging others.  \n\n \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025 .   MMgmt    |    5 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n 10 % of the final grade. Individual assessment.  \nAssessment of \nWriting  Writing skills are not exclusive to English courses and, in fact, should cross all \ndisciplines. The University supports the belief that throughout their University \ncareers, students should be taught how to write well so that when they graduate their \nwritin g abilities will be far above the minimal standards required at entrance. \nConsistent with this belief, students are expected to do a substantial amount of \nwriting in their University courses and, where appropriate, members of faculty can \nand should use wri ting and the grading thereof as a factor in the evaluation of student \nwork. The services provided by the Writing Support, part of the Student Success \nCentre, can be accessed  by all undergraduate and graduate students who feel they \nrequire further assistance.  In this course, your writing will be assessed as part of your \ngrade in the following assessments: class presentation and personal strategy paper.  \nEmail \nCommunication  Please specify the course name and section number in the subject line of all emails  \n(SGMA 672 L01 or SGMA 672 L02) . I will not respond to emails that do not contain this \ninformation.  \nAlthough e mail is commonly used by students to communicate with their instructo rs, \nit does limit the effectiveness of communication  and may not be the best way for me \nto answer student questions . If I feel that communicating via email is not optimal, I \nmay request a telephone call or personal meeting.  \nInternet & \nElectronic \nCommunication \nDevices  \n Please turn OFF your phone before the beginning of each class.  \nStudents are welcome to use laptops and other electronic note -taking devices in \nclasses, however, any surfing of the Internet or use of applications during lectures \nthat is not directly related to the class discussion is distracting and strictly forbidden. \nAdditionally, the use of any electronic devices (e.g., cellular phones/smartphones) for \ne-mailing, text -messaging, etc. is strictly prohibited during class time.  \nPlease respect your fellow students and your instructor and do not disrupt the class \nin any way, including answering cell phone calls, checking email and the Internet on \nany electronic device. It is within my discretion to lower your course grade for \ndistracting the class.  \nPlease note that when I pose a question in class, I do not expect you to look up  the \nanswer – in fact, you should NOT use your electronic devices during class discussion \ntime , unless it is for taking notes. Class discussion time is typically dedicated to \nthinking, debating and analyzing, not researching (unless otherwise specified).   \nAcademic \nIntegrity and \nRigor  \n Academic integrity and rigor are critical components of a University degree. Academic \nintegrity is the foundation of the development and acquisition of knowledge and is \nbased on values of honesty, trust, responsibility, and respect. The Haskayne School of \nBusiness values ethical leadership and personal integrity, and expects its faculty, staff, \nand students to live these values. In the online environment, certain additional \nmeasures will be put in place to help safeguard the integrity of online assessments \nand the intellectual property of the instructors.  \n\n \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025 .   MMgmt    |    6 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n Generative \nArtificial \nIntelligence (GAI) \nuse in the course  Students may use generative AI (GAI) tools in this course in accordance with the \ninstructions and guidelines outlined for each individual course assignment or \nassessment.  The use of GAI tools must be referenced and cited following these \ncitation instructions .  \n \nWhen using GAI, be mindful of privacy and security issues and bias within the systems. \nAny use of GAI should be to support your own thoughts and not replace individual \nwork, including using GAI to provide peer feedback by uploading others’ work without \ntheir explicit consent.  \n \nThe course facilitator will not upload your work into GAI software without your \nexplicit consent.  \nUse of GAI outside assessment or assignment guidelines or without citation will \nconstitute academic misconduct.  It is the student’s responsibility to be clear on the \nlimitations on the use of generative AI tools for each assessment or assessment, on \nthe expectations for citation and referencing, and on fact checking statements created \nby generative AI tools. If you  are in doubt as to the use of generative AI tools in this \ncourse, please discuss your situation with the course instructor.  \nCourse Outline  \nPart B  The Course Outline Part B contains more generalized information for Haskayne and \nthe University. You are responsible for reading and understanding all content in both \nparts of the outline.  \nPart B can be found here  \n \n\n \n \nThis is Part A of the course outline, which is specific to SGMA 672, L01 & L02, Winter 2025 .   MMgmt    |    7 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n Class Schedule & Topics  \n \nPlease note that lecture topics and readings are tentative and subject to change. The dates of \nassessments will not be changed.  \n \nImportant dates (e.g. Block Week, Lecture start dates, Reading Week, etc.) can be found at the following \nweb site: https://calendar.ucalgary.ca/acadsched  \n \n \n \nCOURSE SCHEDULE SGMA 672 L01 & L02, Winter 2025  \nDATE  DETAILS  Class Preparation (readings, \nreviews, etc.)  \nWed., Mar. 5  Introduction to SGMA 672 – Team development   \nWed., Mar. 12  What is strategy?  Chapter 1  \nWed., Mar. 19  Strategic leadership in business.  Chapter 2  \nWed., Mar. 26  Environmental Scan, understanding the opportunities \nand threats.  Chapter 3  \nWed., Apr. 2  Internal Analysis, identifying our strengths and \nweaknesses.  Chapter 4  \nWed., Apr. 9  Creating a competitive advantage.  Chapter 5  \n \n \n\n"}