{"events_preview": [{"id": 0, "date_str": "2025-03-27", "date_obj_str": "2025-03-27T09:00:00", "date_formatted": "2025-03-27T09:00", "confidence": 0.9, "title": "Midterm Quiz", "full_description": "", "description": ""}, {"id": 1, "date_str": "2025-04-06", "date_obj_str": "2025-04-06T09:00:00", "date_formatted": "2025-04-06T09:00", "confidence": 0.9, "title": "Lab Exercises", "full_description": "", "description": ""}, {"id": 2, "date_str": "2025-04-10", "date_obj_str": "2025-04-10T09:00:00", "date_formatted": "2025-04-10T09:00", "confidence": 0.9, "title": "Group Project (Part 1)", "full_description": "", "description": ""}, {"id": 3, "date_str": "2025-04-14", "date_obj_str": "2025-04-14T09:00:00", "date_formatted": "2025-04-14T09:00", "confidence": 0.9, "title": "Group Project (Part 2)", "full_description": "", "description": ""}], "document_text": "This is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    1 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  ENTI 674 L01 and  L02 \nTechnologies of Innovation  \nCourse Outline Part A – Winter 2025,  Q4 \nInstructor  Mohammad Keyhani  \nTelephone  403.220 .3908  \nOffice  SH 436  \nEmail  Mohammad.keyhani@haskayne.ucalgary.ca  \nOffice hours  By appointment only  (www.calendly.com/keyhani/ ) \nWebsite  http://d2l.ucalgary.ca  \nLecture location  MTH 445  \nLecture times  L01: 9:00am  - 11:50am \nL02: 2 :00pm – 4:50 pm \nNo additional tutorial sessions are scheduled  \nAdditional Resources  https://entrepreneur -tools.zeef.com  \nhttps://www.digitvibe.com/  \nCourse Delivery \nFormat  Course content will be delivered face -to-face. In -person attendance is expected.  \nStudents should be prepared to pivot to online learning should current government or University protocols change. Please see the following pages for course details and schedules.  \nCourse Description  The primary aim of this course is to improve the ability of students to leverage the \nlatest digital technologies to engage in innovation, entrepreneurship, and problem -\nsolving in various organizational contexts. Students will not only get to understand the \nleading edge landscape of digital technologies for innovation and entrepreneurship, but also learn to work with them through hands -on exercises.  \nThe course involves lab exercises, an individual prompting report, a midterm quiz, and a \ngroup project.  \nUse of \nGenerative AI  Given that learning generative AI is one of the primary goals of this course, students are \nencouraged to use ChatGPT and/or other relevant generative AI tools for learning and support in all assignments and even the midterm quiz. However, students must take responsibility for any material that they deliver as it will be considered their work, no matter what tools were used to produce it. Inclusion of fake or non -existent references \nor citations or other AI hallucinations in your work may be considered academic \nmisconduct.\n\n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    2 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n Course \nObjectives  \n Upon completion of the course, students will be able to:  \n1. Identify, evaluate, and compare available digital technologies that support \ninnovation and entrepreneurship, with a focus on no -code and generative AI \ntools.  \n2. Use and work with a variety of tools and technologies as well as combinations of \nthem to support the processes of innovation and entrepreneurship, as well as \nautomate tasks and functions for organizations.  \n3. Demonstrate p rofessional communication and public presentation skills.  \n4. Publish media -rich learning material suitable for online distribution.  \n5. Understand the ways in which digital technology is changing the nature of \ninnovation and entrepreneurship.  \nCourse \nWorkload  Generally, it is understood that students should spend two hours per week outside of \nclass time for every hour of lecture. This means that for each course, students should \nexpect to spend approximately 9  hours per week total on course work and lectures. This \nmay vary by week depending on both the assessment schedule and on students’ ability \nto manage their time.  \nGrade Scale  \n   The Haskayne School of Business endeavours to ensure consistency of final grades \nacross courses and sections.  Variations in distribution will always be considered by the instructor where called for by the performance in each individual class.  The student does not have any ‘right’ to a certain grade, but is responsible for earning grades.  The instructor has unfettered discretion to evaluate student performance and assign all grades.  \n \nGrade   Percentage \nScore  Grade \nPoint \nValue  Description  Notes:  \nA+ ≥ 95.0  4.0 Outstanding /exceptional \nperformance  Up to 20% of \nthe class  A ≥ 90.0  4.0 \nA- ≥ 85.0  3.7 Consistent, very high \nquality  work  30-50% of the \nclass  \nB+ ≥ 80.0  3.3 Good performance  30-50% of the \nclass  B ≥ 75.0  3.0 Basic competence  \nB- ≥ \n70.0  2.7 Marginal performance, \ndefined as having gaps \nin basic competence  \nUp to 10% of \nthe class  C+ ≥ 65.0  2.3 \nAll grades below B - are \nindicative of failure at \nthe graduate level and \ncannot be counted toward the course \nrequirements.  C ≥ 60.0  2.0 \nC- ≥ 55.0  1.7 \nD+ ≥ 52.0  1.3 \nD ≥ 50.0  1.0 \nF ≥ 0% 0 \nNote : See the “ Academic Standing ” section of the Faculty of Graduate Studies Calendar \nregarding grades less than B -. \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    3 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n Grade \nDistribution  \n \n Due Date  Assessment  Group or \nIndividual  Weight  Course \nOutcomes \nAssessed  \nThroughout  Class Participatio n Ind. 10% 1, 2, 3, 4, 5  \nSee course \nschedule  Lab Ind. 20% 1, 2 \nApril 10 & \nApril 14, \n2025 Group Project  Group  40% 1, 2, 3, 4, 5  \nMarch 27, \n2025 Midterm Quiz  Ind. 30% 1, 5 \n Total   100%   \n \nTextbook \nand/or Other \nMaterials  Required readings  that will be assessed in quizzes will be determined by the instructor \nand posted on D2L. Other recommended readings will be posted on D2L as well.  There \nis no required textbook  for this course, but the following are  recommended book \n(parts of which may be listed in required readings):  \n \nSimon, P. (2022). Low -Code/No -Code: Citizen Developers and the Surprising Future of \nBusiness Applications. Racket Publishing.  \n Goss, K. (2023). Automate It with Zapier and Generative AI: Harness the power of no -\ncode workflow automation and AI with Zapier to increase business productivity. Packt Publishing.  \n \nPhoenix, J., & Taylor, M. (2024). Prompt engineering for generative AI: Future -proof \ninputs for reliable AI outputs.  O’Reilly Media.  https://www.amazon.ca/Prompt -\nEngineering- Generative -AI-Future -Proof/dp/109815343X/ \n \nStatement on the use of generative AI:  The use of generative AI tools is required  and it \nis encourage to use it in any shape or form to improve the quality of your work in this course . Paid tools such as Claude.ai or ChatGPT premium are highly recommended. \nStudents are asked  never to cite AI tools  as that would be an offloading of responsibility  \n(unless it makes sense to do so  because for example you are showcasing the capabilities \nof an AI ). Students  are asked to follow the “Read and Revise Until You Own ( RRUYO)” \nrule because they will be held responsible for the content as explained here: https://www.digitvibe.com/essence -of-writing/  \n \nNote: the final project requires the use of AI -assisted software development tools. If \nyou cannot find a free tool, you can use a trial version of a paid tool to avoid paying.  \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    4 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n Missed \nAssessment \nPolicy  \n Students must coordinate with the instructor to seek a deferral for missed work during \nthe term, including quizzes, assignments, and exams.  Typically, deferrals are only granted in cases of illness, domestic affl iction, or religious conviction, and are entirely at \nthe discretion of the instructor.  If a deferral is granted, an instructor may require a \nmake- up assessment to be completed or transfer the weight of the missed assessment \nto another assessment in the course.  \nLate Policy  Carefully read the cour se timetable and emails from the instructor  for assignment due \ndates. Late assignments will result in a penalty of 5 % per day late , including weekends \nand holidays, unless a valid exception has been made by the Instructor prior to the due \ndate. Exceptions will only be granted, at the instructors’ discretion, who will typically \nrequire  presentation of suitable documentation.  Assignments less than one day late are \nsubject to smaller penalties at the discretion of the instructor. Note that an assignment \nsubmitted  five or more days after the due date will be assigned a grade of 0%.  \nClass \nParticipation  \n The class participation grade  will be made up o f various components including  \nprofessionalism in working & communicating with you r classmates and the instructor, \nas well as contribution to the classroom discussions, activities and exercises. Evaluation \nof the quantity and quality of student participation is in the sole discretion of the instructor.  You are encouraged t o bring name tags or tent cards to every session of class \nso the instructor can better give you participation marks when you deserve them. Ma ke \nsure your name tags are readable and  include both your first and last name.  Class \nparticipation grade will also include required online activities such as timely creation and preparation of web and social media accounts and providing feedback to peers on \nassignments.  \n \nStudents are strongly advised to have a comprehensive and up -to-date LinkedIn \nprofile . \n Note:  for this class you will need to sign up for many different web applications. If you \ndo not want to use your personal email for this purpose, it may be a good idea to create a new email address like firstname.lastname.enti647@gmail.com  just for this class. \nAlso, you may be asked to create mock social media and web accounts for imaginary people or companies for some class exercises, in which case it is more convenient to \navoid using your personal email and use the above -recommended class -specific email.  \nAssignments  \n Lab sessions occur during regular class hours and will involve exercises that you will be \ngraded on. You may be asked to partner up with other students for lab exercises but \nwill be graded individually. Lab exercises are to be completed in class but you will \ntypically have until the end of day to submit the deliverables.  \n Unless indicated otherwise, all assignments should be handed in electronically  to the \ninstructor on the date indicated in the course timetable, by uploading the electronic \nfile to the relevant dropbox section  or discussion board section  in D2L.  Unless \nexplicitly requested by the instructor or TA, DO NOT send your assignments by email or hand in a printed hard copy.   \nThe passing grade for this course is based on the sum of all components, and no \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    5 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n individual component determines passing or failing.  \nGroup Project  \n Although some class time is allocated to group projects, please consider that your team \nwill likely need to have meetings outside of class time. Students are expected to \nparticipate in class activities and the  group project through communication with all \nteam members, attendance at team meetings and execution of the assignment in a \ncollegial manner. All  group members should be present at group presentations.  \n The details of the group project can be found in the appendix to this course outline.  \nAll deliverables must be submitted as per the a ssignment instructions  (see appendix) . \nNo exceptions or extensions will be granted unless alternative arrangements have been \nconfirmed by the instructor, at his/her sole discretion, prior to the due date. It is the student’s responsibility to ensure that the assignment has been delivered to the instructor in strict compliance with the assignment instructions.   \n \nIn the case of conflicts within your group, you are encouraged to try to resolve the conflict internally, although you may bring it up with the instructor as a last resort. If the instructor finds enough evidence of social loafing or other indications that a group member has fallen short of their group work responsibilities, the instructor has full \ndiscretion to reduce the group project grade for that individual as they see fit.  \nMidterm Quiz  \n The course includes one mid -term quiz that is typically administered on D2L. Students \nwill have to complete the quiz in class on the date indicated in the course timetable. Students are responsible for ensuring access to a laptop or tablet on which they can take the online quiz in class. If you need help securing a device, please let the instructor know in advance.  \nIn case of technical difficulties or other reasonably justified reasons that prevent one or more students from taking the exam, the instructor will work with the affected student(s) to find an alternative assessment for this grade component.  \nDeferral date:  contact the instructor if you need to request a deferral of the mid -term \nquiz.  \nActivities \nOutside of Class \nTime  Students are required to coordinate and work with their groups on the group project \noutside of class time.  \nEmail \nCommunication  Please specify the course name and section number in the subject line of all emails \n(e.g., ENTI 674 L01).  The instructor may  not respond to emails that do not contain this \ninformation.  \nAlthough e mail is commonly used by students to communicate with their instructo rs, it \ndoes limit the effectiveness of communication  and may not always be the best way to \nanswer student questions .  If a student or the instructor feels that communicating via \nemail is not optimal, they may request a telephone call or personal meeting.   \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    6 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n Internet & \nElectronic \nCommunication Devices  \n It is recommended and  sometimes required to  have a laptop  with you in class to \nparticipate in class activities requiring access to software or the internet . However, \nany general surfing of the Internet , texting, chatting, emailing, tweeting, etc.  during \nlectures that is not directly related to the class discussion is distracting and \ndisrespectful.  \nAcademic \nIntegrity and \nRigor  \n Academic integrity and rigor are critical components of a University degree. Academic \nintegrity is the foundation of the development and acquisition of knowledge and is based on values of honesty, trust, responsibility, and respect. The Haskayne School of Business values ethical leadership and personal integrity, and expects its faculty, staff, and students to live these values. In the online environment, certain additional measures will be put in place to help safeguard the integrity of online assessments and \nthe intellectual property of the instructors.  \nCourse Outline   \nPart B   The Course Outline Part B contains more generalized information for Haskayne and the \nUniversity. You are responsible for reading and understanding all content in both parts \nof the outline.   \nPart B can be found here   \n \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    7 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n  Class Schedule & Topics  \n \nPlease note that lecture topics and readings are tentative and subject to change.  The dates of \nassessments will not be changed.  \n Important dates (e.g. Block Week, Lecture start dates, Reading Week, etc.) can be found at the following web site: https://calendar.ucalgary.ca/acadsched  \n \n \nCOURSE SCHEDULE  \nDATE  DETAILS  Notes  \nSession 1:  \nMarch 13, 202 5 Intro  and Lecture  Recommended to bring a \nlaptop to class  \nSession 2:  \nMarch 1 4, 202 5 Lab:  Hands -on exercises using a variety of tools  Must bring a laptop to class  \nSession 3:  \nMarch 2 0, 202 5 Lecture  and in- class exercise  Recommended to bring a laptop to class  \nSession 4:  \nMarch 27, 202 5 Mid-term quiz  \nLecture on coding with GenAI  \nFinal group project kick -off Must bring a laptop to class  \nSession 5:  \nApril 3 , 202 5 Supervised work on group project , sharing best \npractices.  Must bring a laptop to class  \nSession 6:  \nApril 10, 2025  Group Project  Presentation  Day \n 11:59pm  Last chance to contribute on discovery forum.  Make sure slides are ready to present.  Prevent \ntechnical difficulties. \nApril 11, 202 5 11:59pm  Deadline to post  main group project \ndeliverable as well as  link to publicly published blog \npost about the group project on D2L  \n  \n \n \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    8 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n Appendix: Details of Assignments  \n \nThe Discovery Forum  \nA discussion board on D2L is dedicated to discoveries made by students in the class. Activity on this \ndiscussion board accounts for a large part  of your participation grade  in the class. This activity should \ninclude all three of the following:  \n1. Posting : post about things you discovered in the world of no -code and generative AI beyond what \nyou learn in class. This can be a new app or tool, a learning resource (book, article, website, discord group, twitter thread, etc.), a prompting technique or template you found online, or something new you discovered yourself about the behavior of generative AI or an interesting way to use a tool. Pretty much anything about technology and tools that students in the class would find useful is eligible as a post. Your posts must include more than just a link and also include your own thoughts on why the material is useful. A minimum of 10 posts is expected from each student over the course \nof the class.  \n2. Voting : upvote the best posts by others in the forum so that discovering the best material is made \neasier for others. A minimum of 20 votes is expected from each student over the course of the class.  \n3. Commenting : provide constructive commentary or feedback on posts made by others. A minimum of \n10 comments is expected from each student over the course of the class.  \n \nYou can contribute to the forum up until the last day of class.  Note that careless or unprofessional \nactivity on the forum will be penalized, as will activity that is disrespectful or abusive.  \n \n \nFinal Project:  AI-Assisted Software Development  \nThe final project is a major deliverable worth 4 0% of your final grade where student teams (as assigned \nby the program) will develop a software application using modern AI -assisted development tools. This \nproject combines practical development experience with business thinking, allowing you to create \nworking software without needing prior programming experience.  The best projects will be those that \neffectively leverage AI's strengths while maintaining a manageable scope that can be completed within the tight timeframe.  \n \nProject Components and Grading  \n• Application Development & Documentation (20%): Building a working application and \ndocumenting it properly on GitHub  \n• Public Presentation  & Reflection ( 20%): A publicly published blog post or LinkedIn article \ndocumenting your journey and showcasing your work  \n \nCore Requirements  \nYour team must build an application that:  \n• Solves a clear business problem or addresses a market opportunity  (you can use AI to ideate)  \n• Is developed primarily using AI- assisted development tools  (such as Cursor.com, v0.dev, Replit \nagent, and Bolt.New) . Use trial versions if you need to.  \n• Is properly documented on GitHub with AI assistance (including README, setup instructions, \nand clear documentation)  \n \n \n\nThis is Part A of the course outline, which is specific to ENTI 674 L01 and L02 .   MMgmt   |    9 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne MMgmt  courses.  \n \n Technology Recommendations  \n• A web or mobile application built with html / css / javascript and the React  framework  is highly \nrecommended as it works well with current AI tools and has excellent support, but other \nframeworks are acceptable . \n• Deployment  (making the working app available on the cloud)  is optional but encouraged.  \n• Making your Github repository public is required but exceptions may be allowed with proper justification. \n Development Approach  \nYou will use a combination of AI tools to develop your application. The course will cover various tools and approaches, but at minimum your development process should include:  \n1. Using AI tools  like ChatGPT or Claude  for initial ideation, prototyping and component \ndevelopment  \n2. Using a proper IDE like VSCode or Cursor with AI assistance for the main development  \n3. Leveraging AI for code documentation and GitHub repository setup  \n \nBlog Post Requirements  \nKnowing that your name will be publicly associated with the project is used as a pedagogical tool here \nbecause it elevates the stakes and motivates high quality work. The blog post should be 1000 -3000 \nwords, published publicly on LinkedIn or a similar platform  (not private or password protected) , and \nmust include:  \n• Acknowledgment of the course (Master of Management program at Haskayne School of Business, University of Calgary) \n• Clear listing of all team members  \n• Problem statement and business case  \n• Overview of the solution and key features , including the tools used in the development process  \n• Discussion of the development process and how AI tools were used, with examples and screenshots of some of the prompts used.  \n• An embedded video tutorial showing a narrated screen recording of using the app ( ideally no \nmore than 3 minutes).  \n• Lessons learned and reflections on AI -assisted development  \n \nImportant Notes  \n• Teams are encouraged to  validate their project idea with the instructor  \n• The project should be original work specific to this course  and not building on work previously \ndone outside of this course by any team member.  \n• While the presentation is not separately graded, it should effectively demonstrate the working application and your learning journey , and it will be used as a key point of judgement about the \nquality of your work.  \n• The most important aspect of your presentation is to convey the value of the work that you did, not to spice up the presentation itself.  \n• It is encouraged but not required for all group members to participate in the presentation.  \n Submission Requirements  \nBy the deadline indicated in the course timetable, post to the D2L discussion board:  \n1. A link to your GitHub repository  \n2. A link to your published blog post/article  \n\n"}