{"events_preview": [{"id": 0, "date_str": "2025-03-25", "date_obj_str": "2025-03-25T09:00:00", "date_formatted": "2025-03-25T09:00", "confidence": 0.9, "title": "Group Project Part 1", "full_description": "", "description": ""}, {"id": 1, "date_str": "2025-03-25", "date_obj_str": "2025-03-25T09:00:00", "date_formatted": "2025-03-25T09:00", "confidence": 0.9, "title": "Class Participation", "full_description": "", "description": ""}, {"id": 2, "date_str": "2025-04-01", "date_obj_str": "2025-04-01T09:00:00", "date_formatted": "2025-04-01T09:00", "confidence": 0.9, "title": "Class Participation", "full_description": "", "description": ""}, {"id": 3, "date_str": "2025-04-08", "date_obj_str": "2025-04-08T09:00:00", "date_formatted": "2025-04-08T09:00", "confidence": 0.9, "title": "Group Project Part 2", "full_description": "", "description": ""}, {"id": 4, "date_str": "2025-04-08", "date_obj_str": "2025-04-08T09:00:00", "date_formatted": "2025-04-08T09:00", "confidence": 0.9, "title": "Class Participation", "full_description": "", "description": ""}, {"id": 5, "date_str": "2025-04-10", "date_obj_str": "2025-04-10T09:00:00", "date_formatted": "2025-04-10T09:00", "confidence": 0.9, "title": "Group Project 2: The Value", "full_description": "", "description": ""}, {"id": 6, "date_str": "2025-04-11", "date_obj_str": "2025-04-11T09:00:00", "date_formatted": "2025-04-11T09:00", "confidence": 0.9, "title": "Assessment", "full_description": "", "description": ""}], "document_text": "This is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    1 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n  \n \n \n \n \n \nOBHR 674 L01 & L02  \nAdvanced Human Resource Management   \n \nCourse Outline  Part A  – Winter 2025  \n \nInstructor  Audrey J. Farrier , B.A., MSc.  \nTelephone  Please contact me by email  \nOffice  By appointment  only  \nEmail  ajfarrie@ucalgary.ca  \nOffice hours  By appointment only  \nWebsite  http:// d2l.ucalgary.ca  \nLecture location  MTH 445  \nLecture times  March 3 till April 11, 2025  \nL01: 09 :00-11:50 a.m.  \nL02:  14:00 -16:50 p.m.  \n  \nDiscussion/Tutorial  \nMarch 10 till April 11, 2025 \nL01: 08 :00-08:50 a.m.  \nL02:  13:00-13:50 p.m.  \n \nCourse \nDescription  For businesses to thrive, an understanding of the management of human resources is absolutely \nessential. A successful business is contingent on developing more than just technical skills. Developing skills  and tools needed to effectively manage people and knowing the \nrules that \ngovern workplace relations are essential skills to develop. Further, truly great organizations do not happen by accident, they are established and fostered by individuals with an extensive understanding of managing human resources. This advanced  course is designed to give you an \nin-depth look at academic research, theories, and application of human resources management. \nThe intent of OBHR 674 is to explore and understand how to naviga te the organization through \nkey HR practices  such as job design, recruitment, selection, training, career development and \ntalent management, labo ur relations, occupational health and safety, legal issues, and other \nassociated activities. Using a variety of instructional techniques, you will learn and apply the \n\n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    2 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n theory and practice surrounding HR in an effort to increase your personal effectiveness within \nan organization, and ultimately the effectiveness of the organization itself.  \nCourse \nObjectives  \n By the end of the course, students will be able to demonstrate their mastery of the course \ncontent through the following course outcomes:  \n1. Taking a strategic approach to human resource management.  \n2. Developing the ability to apply knowledge and understanding of HRM to improve business and management and practice.  \n3. Developing a good understanding of the employment relationship from both an \nemployee and managerial perspectives.  \n4. Understanding and critically evaluating variety of key HR topics such as: job design, \nrecruitment, selection, training, talent management, legal issues, and other associated \nactivities.  \n5. Learning about performance and reward management to ensure how to get the best \nfrom people and gain a competitive advantage.  \n6. Practicing advanced HR management skills, and critically evaluating information  to make \neffective HR decisions.  \n \n  \nTextbook and/or \nOther \nMaterials  \nand \nResources  \n  Required  materials:   \n \nOpen Educational Resource (OER):  \nHuman Resources Management, 3rd edition  \nDebra Patterson  \nDate Published:  May 03, 2023 \nLicense:  CC BY -NC-SA \nRequired Resources:  The textbook for this course is the Open Educational Resource (OER) found  \nand downloaded at the following link:  \nHuman resources management, 3 rd edition  \n \nSupplementary materials:   \nIn addition to the textbook, students are required to complete a few  readings . (These articles \nwill be posted on D2L ).  \n  \nIn class, we will engage in a few Case Studies and HR practices to illustrate concepts and apply \nthem to real business situations. Students will need to read and prepare to discuss/engage in \nthese activities before and after each class.  \n \nStudents may use generative AI (GAI) tools in this course in accordance with the instructions \nand guidelines outlined for each  individual  course assignment or assessment.  The use of GAI \ntools must be referenced and cited following these citation instructions .  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    3 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n  \nWhen using GAI, be mindful of privacy and security issues and bias within the systems. Any use \nof GAI should be to support your own thoughts and not replace individual work, including using GAI to provide peer feedback by uploading others’ work without the ir explicit consent.  \n \nCourse Workload  \n \n  Tutorials  \n  \nClass \nPreparation Generally, it is understood that students should spend two to three hours per week outside of \nclass time for every hour of lecture.  This means that for each course, students should expect to spend approximately 8 -9 hours per week total on course work and lectures.  This may vary by \nweek depending on both the assessment schedule and on students’ ability to manage their time. The instruction and rubric for the project will be po sted on D2L . \n The course tutorial sessions are scheduled from 8:00 am to 8:50 a. m. for L01 and 13:00- 13:50 \np.m. for L02. During these sessions, students will engage in group work, discussions, and \ncomplete exercises.  \n \nThis class relies heavily on experiential learning. Unlike the traditional lecture method, the \nexperiential learning requires more meaningful involvement of students in the class (but also results in more fun and “sticky learning”). You are expected to be an active participant in the \nlearning process. Engaged students devote time and energy to read assigned textbook chapters \nand other reading materials before the class, actively listening to others during class discussions and contributing to class discussi ons. Students are also expected to actively engage in class \ndiscussions over discussion board.   \nPlease Note:  Your instructor may not necessarily cover all the materials in the chapter, but it is \nthe responsibility of the student to understand the concepts presented in the textbook and \nlectures.  Material that can be easily learned by reading the textbook and ass igned articles may \nnot be covered in class. For example, term definitions, facts, and other simple material from the \ntextbook that you can learn on your own by reading the textbook may not be provided in class. However, this material will be co vered on the quizzes. Lectures will focus on the material \npresented in the textbook and general discussion and practices relating to the topic(s) outlined \nin the lecture schedule. If you are unsure of any of the concepts, please take the initiative to ask \nthe instructor during clas s. \n Important information for this class is posted on and communicated through Desire2Learn \n(D2L). Students should regularly check the Announcements section of the course D2L site for ongoing notices.  \n \nGrade Scale  \n \n \n The Haskayne School of Business endeavours to ensure consistency of final grades across \ncourses and sections.  Variations in distribution will always be considered by the instructor \nwhere called for by the performance in each individual class.  The student  does not have any \n‘right’ to a certain grade but  is responsible for earning grades.  The instructor has unfettered \ndiscretion to evaluate student performance and assign all grades.  \n \nGrad   Percentag Grade Description  Notes:  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    4 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n e e Score  Point \nValue  \nA+ ≥ 95.0  4.0 Outstanding  Up to 20% \nof the \nclass  A ≥ 90.0  4.0 Excellent  \nA- ≥ 85.0  3.7 Very good \nperformance  30-50% of \nthe class  \nB+ ≥ 80.0  3.3 Good performance  30-50% of \nthe class  B ≥ 75.0  3.0 Satisfactory \nperformance  \nB- ≥ 70.0  2.7 Minimum pass  \nUp to 10% \nof the class  C+ ≥ 65.0  2.3 All grades below B-  \nare indicative of failure at the graduate level and cannot be \ncounted toward the \ncourse requirements.  C ≥ 60.0  2.0 \nC- ≥ 55.0  1.7 \nD+ ≥ 52.0  1.3 \nD ≥ 50.0  1.0 \nF ≥ 0% 0 \n  Note : See the “ Academic Standing” section of the Faculty of Graduate Studies Calendar \nregarding grades less than B- . \nThe Associate Dean (Professional Graduate Programs may determine that grades are too high \nand may override the grades of the instructor. The grade distributions for class must be checked \noff by the MMgmt office.  \nGrade \nDistribution  \n \n Due Date  Assessment  Weighting  Course \nOutcome \nAssessed  \nOn-going  Class participation , on-line \ndiscussion  15% 1,2,3,4,5,6  \nSoft copy due in D2L \nDropbox March 1 7, \n2025, 11:59 MST  \n Individual Assignment #1 Culture of Diversity  \n 20% 1,2,3,4,5,6  \nSoft copy due in D2L \nDropbox March 31 , \n2025, 11:59 MDT  Individual Assignment #2 \nJob Analysis  25% 1,2,3,4,6  \nSoft copy due in D2L \nfollowing each week’s class or \ntutorial  Group Exercises  #1 \n 15% 1,2,3,4,5,6  \nSoft copy due in D2L \nDropbox April 10, \n2025, 11:59 MDT  Group Project # 2: The Value \nof HRM (Super 7 \nFramework)  25% 1,2,3,4,5,6  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    5 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n  \n Total  100%   \n \n \nMissed \nAssessment & Late \nPolicy  \n  \nIn fairness to students who complete work on time, class assignments submitted after the due \ndate will be subject to a penalty of 10%  per full or partial day, including weekends and holidays. \nNote that an assignment submitted five or more days after the due date will be assigned a grade \nof 0.  \nStudents must follow the guidelines outlined in Part B  of the outline to request a deferral for \nmissed work during the term . \n If there are any circumstances that may affect your performance in this class, please let me \nknow as soon as possible before the due dates , so we can work together to develop strategies \nthat address your needs and enable you to meet the requirements of the course. I am always \nhappy to assist you in any way I can.  \n  \nClass \nActivities, \nDiscussion,  \nCase \nStudies, exercises,  \nrole plays, \ndiscussion \nboard  \n Throughout the course, you will be encouraged to think creatively about how to use ideas and theories to develop insight about HR practices in organizations. The primary way of doing this is \nduring our class discussions and, in preparation for these discus sions, thinking critically about \nthe relevant readings, and case studies. A ttend  all classes,  be well prepared, and participate \nregularly in class activities and exercises . There will be many opportunities for discussions and \nactivities, and the learning potential comes from everyone’s contributions.  \nStudents are expected to read the assigned text chapters ( and articles , if any)  before class and  \nbe prepared for the class discussion about the topics outlined in the lecture schedule. In each \nclass, students will  work on exercises and cases in groups or individually. Active participation in \neach in class practice is required of all students –  as such, attendance in class is necessary . Each \nexercise will have deliverables (usually written) at the end of the class or tutorial.  Students or \ngroups will comple te these in class assignments and submit or upload the required documents \nunto D2L as evidence of participation at the end of the class  or tutorial. For some of these \nexercises, you'll also participate in peer assessment s, which will enable you to see how fellow \nlearners approached the same challenge and how others viewed your HR solutions.  \nStudents will also participate in the discussions posted on the discussion board. I will provide \nweekly mini -cases and problems related to the HR topic on the discussion board to allow you to \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    6 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n answer the questions and brainstorm together. You will  brainstorm and collaborate for the \nproblem solving and application of the course concepts.  You will share perspectives and  ideas \nwith the group and ask thoughtful questions in your responses to one another to facilitate a \nrobust  conversation. Provide strong feedback or comments to reach a deeper level of \nunderstanding. Do  not make separate or unrelated posts.     \nAssessment measures for the discussions in class or t he discussion board will include response \nwriting to the exercises  in class  or tutorial opportunities , responses uploaded to D2L, individual \nand group discussions, and the quality of your reply or comments to your peers.  \n \nAssignments  \n Individual Assignment #1 : Case Assignment – Culture of Diversity  \nStudents will research and develop a 1250- 1500 -word HRM response on how to manage  six \n“real- life” diversity scenarios presented in the assigned case study.  You will research the issues \npresented, providing supporting evidence and rationale for the measures you recommend; you will illustrate the impact your solutions could bring to foster a more inclusive and respectful \nworkplace.  \nIndividual Assignment # 2 : Job Analysis  - The Cornerstone of HR  \nYou will conduct a full job analysis to provide a c ritical review of a current job posting for a real \ncompany.  You will have a choice of a position and level (e.g., entry level; professional level; \nmanager level; “C” Suite level roles).  You will conduct a job analysis for the position (using \nO*NET or NOC)  and two of the various methodologies available for a job analysis  and critique \nthe job posting  You will present your key findings in a  KCAD  analysis framework – what did \nyou Keep from the original posting (and why); what did you  Change from the original posting \n(and why); what did you  Add in (and why); what did you  Delete (and why)?  You will reconstruct \nthe job posting based on your analysis.  \n \nGroup \nProject  \n  Group Exercises #1:  \nYour group will complete a  series of exercises designed to offer you  practice in HRM . The \nexercises will be largely completed during the tutorial/discussion time frames, although the exercise will be explained and, at times, started /finished during class , usually  the previous \nweek. Your groups will work to complete the exercise during the tutorial and will be submitted \nfollowing the tutorial before the commencement of the class  or by the end of day  of the class in \nthe D2L Drop Box. The instructor will be available for help and coaching during the tutorial. \nWorksheets or templates along wi th scenarios will be provided for the following exercises:  \n1. Policy Development Exercise \n2. Developing a Training Design Plan Exercise  \n3. Job Evaluation Exercise  \n4. Performance Appraisal Exercise  \n5. Grievance Arbitration Exercise   \n6. Safety  Audit Exercise  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    7 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n   Group Project #2: Th e Value of HRM (Super 7 Framework)  \nThe Super 7 Framework’s seven categories, present 2 levels of primary responsibility as well as \nthe interactive partnership between the management and the employee. As a group you will  act \nas a consultancy team to prepare,  explain and support with examples and references, the role of \nHuman Resource Management (HRM) in supporting each of these seven categories using the \nconcepts, theories and practices as covered in the course . This assignment can be developed as \na power point with accompanying notes or a paper 2000 -2500 words.  \n You will complete each assignment individually except for the Group Exercises and Group \nProject*. You must use and cite course material ( text, assigned  readings , class material and \ndiscussions) and peer -reviewed academic journals as your primary sources, and, if desired, \nexternal references (blogs, professional newsletters, white papers, opinion pieces, company \nwebsites) no more than 3 0% of total volume of references as a foundation for your analyses \nwithin each of your assignments. APA style is to be used consistently throughout each \nassignment. Instructions and  Rubrics for each assignment are posted in D2L.  \n \n Note: Social loafing is the reduction of individual contributions, at and at times, non -\ncontributing, when people work in groups rather than alone. You will be evaluated on your group’s success for the group project but must have identifiable individual performance indicators for each project . Should one of your team members do not do their fair share of work, \nyour team has an option to conduct a peer review. It is the team’s responsibility to first attempt \nto resolve the matter within the team. Then, if not fully resolved, the team must notify th e \ninstructor of this issue. So that corrective action can be taken before it is too late, please contact \nthe instructor early in the semester. If the matter cannot be resolved to the team’s satisfaction, \nthe team may request the peer evaluation form, which  will be submitted by individual team \nmembers by the last day of regular classes. Peer reviews allow each team member to evaluate \nthe performance of other team members, and the evaluations of your peers could reduce your grade to zero for the team project.  (Peer reviews are not normally done except when someone \nclearly is not doing their fair share of work.)  \n \nAssessment of Writing  Writing skills are not exclusive to English courses and, in fact, should cross all disciplines. The University supports the belief that throughout their University careers, students should be taught how to write well so that when they graduate their writin g abilities will be far above the \nminimal standards required at entrance. Consistent with this belief, students are expected to do \na substantial amount of writing in their University courses and, where appropriate, members of \nfaculty can and should use wri ting and the grading thereof as a factor in the evaluation of \nstudent work. The services provided by the Writing Support, part of the Student Success Centre, can be accessed  by all undergraduate and graduate students who feel they require further \nassistance.  In this course, your writing will be assessed as part of your grade in the following \nassessments:  \n 1. Individual Assignment # 1: Culture of Diversity  \n2. Individual Assignment #2: Job Analysis  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    8 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n 3. Discussion Board Postings  \n4. Written submissions of group  exercises  \n5. Group Project # 2: Value of HRM (Super 7 Framework)  \n  \nEmail \nCommunication Please specify the course name and section number in the subject line of all emails OBHR 674. I will not respond to emails that do not contain this information.  \nAlthough e mail is commonly used by students to communicate with their instructo rs, it does \nlimit the effectiveness of communication  and may not be the best way for me to answer student \nquestions . If I feel that communicating via email is not optimal, I may request a telephone call or \npersonal meeting.  \nInternet & \nElectronic \nCommunication Devices  \n During this class students will have the opportunity to utilize their personal electronic devices as \nlearning tools to facilitate certain class activities. If your cell phone, tablet, or laptop does not \nbecome a distraction, it is fine for you to use it in class. I reserve the right to request that you put the device away if it is being used for activities unrelated to the class.  \nAcademic Integrity and Rigor  \n Academic integrity and rigor are critical components of a University degree. Academic integrity is the foundation of the development and acquisition of knowledge and is based on values of honesty, trust, responsibility, and respect. The Haskayne School of Business values ethical leadership and personal integrity, and expects its faculty, staff, and students to live these values. In the online environment, certain additional measures will be put in place to help safeguard the \nintegrity of online assessments and the intellectual property of the instructors.  \n  \nCourse Outline  \nPart B  The Course Outline Part B contains more generalized information for Haskayne and the University. You are responsible for reading and understanding all content in both parts of the outline.  \nPart B can be found here  \n \n \n \n \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    9 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n HSB Team Cooperation Standard \n \nTRAIT  Unacceptable  Acceptable  Exemplary  \nCommitment  Seems reluctant to engage \nfully in discussions and task \nassignments  Consistently \ndemonstrates commitment to the project by being prepared \nfor each group meeting.  Follows up on ideas and \nsuggestions from previous meetings and reports findings to the group  \nBalance between \ntask and interpersonal relations  Focuses exclusively on task to \nbe accomplished without regard to team members or focuses exclusively on interpersonal relations \nwithout regard to task  Balances the need for task \naccomplishment with the needs of individuals in the group  Volunteers to assist \nothers and shares information openly.  \nContributions  Does not offer ideas or \nsuggestions that contribute to problem solving.  Frequently offers helpful \nideas or suggestions  Listens actively and shows \nunderstanding by paraphrasing or by acknowledging and \nbuilding on others’ ideas.  \nStays on Track  Takes the group off track by \ninitiating conversations or discussions unrelated to the \ntask.  Introduces suggestions \nand ideas that are relevant to the task  Uses tact and diplomacy \nto alert group that focus has strayed from the task \nat hand  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    10 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n HSB Oral Communication Standard \n \nTRAIT  UNACCEPTABLE  ACCEPTABLE  EXEMPLARY  \nOrganization  The student communicates \nwith little or no cohesion \nduring the presentation. The student has little or no ability to communicate \nrelationship to overall \npresentation goals.  The student has basic \nstructure and opening statement relevant to the topic and overall presentation goals. The \nstudent gives outline of \nspeech. The student is mostly organized and focused \nthroughout.  The student has a clear \nopening statement that catches audience’s interest and maintains a well-organized structure \nthroughout the presentation. \nThe student stays focused throughout the presentation.  \nContent  The student does not meet \nassignment requirements; the presentation content is not current, nor objective.  The content presented fulfills \nassignment requirements. The student uses appropriate sources and is objective.  The student is more thorough \nthan \"average\" in fulfilling assignment requirements. Research goes beyond \nminimum requirements.  \nTransitions  The student provides no or \ninadequate transition to the following speaker. No connection made between \nsections of the presentation  The student provides basic \ntransition to the next \nspeaker. The student may introduce next speakers \nname but not the topic of \nthat speaker.  The student provides a clear \ntransition to the next \nspeaker. Introduces the name and topic covered by the \nsubsequent speaker.  \nVoice quality \nand pace  Demonstrates one or more \nof the following: mumbling, \nhard to understand English, too soft, too loud, too fast, \ntoo slow.  Can easily understand the \nstudent – the student \ndemonstrates appropriate pace and volume.  Excellent delivery. The \nstudent modulates voice, projects enthusiasm, interest, confidence.  \nMannerisms  Demonstrates one or more \ndistracting mannerisms, which may include bad \nposture.  The student demonstrates no \ndistracting mannerisms. The student has decent posture.  Uses body language \neffectively to maintain audience’s interest.  \nUse of media  The student relies heavily on \nslides or notes. Makes little eye contact. Some key \npoints may not have a \ncorresponding slide.  The student looks at slides to \nkeep on track with presentation. The student \nhas an appropriate number \nof slides and non -distracting \nslide content.  Slides are used effortlessly to \nenhance speech.  \nQuality of \nconclusion  Conclusion is missing or \npoor, not tied to analysis. Does not summarize points that brought the speaker to \nthis conclusion.  Conclusion is adequate. \nSummarizes presentation's main points, and draws conclusions based upon \nthese points.  Goes beyond \"average\" in \ndelivering a conclusion that is very well documented and persuasive. Covers all key \npoints previously discussed.  \nHSB Written Communications Standard \n \nTRAIT  Unacceptable  Acceptable  Exemplary  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    11 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n Logic & \nOrganization  Does not develop ideas \ncogently; uneven and \nineffective overall organization; unfocused introduction or conclusion  Develops unified and \ncoherent ideas within paragraphs with generally adequate transitions; clear overall organization relating \nmost ideas together; good \nintroduction and conclusion  Develops ideas cogently, \norganizes them logically with \nparagraphs and connects them with effective transitions. Clear and specific \nintroduction and conclusion  \nLanguage  Uses words that are unclear; \nsentence structures \ninadequate for clarity; errors may be distracting  Word forms are correct. \nSentence structure is effective  Develops concise standard \nEnglish sentences. Balances a variety of sentence structures effectively  \nSpelling and \nGrammar  Writing contains more than \none spelling or grammatical \nerror  The writing follows normal \nconventions of spelling and \ngrammar throughout and \nhas been carefully proofread  The writing is essentially \nerror- free in terms of spelling \nand grammar  \nDevelopment \nof Ideas  Several ideas unsupported; \nconfusion between personal \nand external evidence; reasoning flawed  Supports the majority of \nideas with effective examples, references, and details; makes key distinctions  Explores ideas vigorously; \nsupports points fully using a balance of subjective and objective evidence; reasons effectively, making useful \ndistinctions  \nPurpose  The purpose and focus of \nthe writing are not clear to the reader  The writer has made good \ndecisions about focus, organization, style, and content so as to achieve the \npurpose of the writing  The writer’s decisions about \nfocus, organization, style, and content fully elucidate the purpose and keep the purpose \nat the centre of the piece  \n   \n  \n \n  \n\nThis is Part A of the course outline, which is specific to OBHR 674 .    MMgmt   |    12 \nPlease ensure you review Part B for policies and procedures applicable to all Haskayne graduate  courses.  \n  Class Schedule & Topics  \n \nPlease note that lecture topics and readings are tentative and subject to change. The dates of assessments will \nnot be changed.  \n Important dates (e.g. Block Week, Lecture start dates, Reading Week, etc.) can be found at the following web site: https://calendar.ucalgary.ca/acadsched  \n \nCOURSE SCHEDULE OBHR 674  \nDATE  Details  Class preparation  \nMarch 3 \n Review of Outline  \nStrategic Human Resource Management  \nThe Super Seven Framework  \nTeam Formation  for project s/exercises  Chapter 1   \nMarch  10 Diversity Equity & Inclusion and the Law  \nWork -life Integration  \nPolicy Development Exercise  (1) Chapter 3 \n \n \nMarch 1 7 Recruitment & Selection  \nJob Analysis Exercise  \nTraining and Development  \nDeveloping a Training Design Plan Exercise  (2) \nIndividual Assignment #1 Culture of Diversity Due: March 17  Chapter 5 & 6  \n  \nMarch 2 4 Compensation Management  \nEmployee Benefits and Services  \nJob Evaluation Exercise  (3) Chapter 7  \n \n \nMarch 31  Performance Management  \nLabour Relations   \nPerformance Appraisal Exercise  (4) \nGrievance Arbitration Exercise  (5) \nIndividual Assignment #2 Job Analysis Due: March 31  Chapter 8 & 10  \nApril 7 Health & Safety  \nSafety Audit Exercise  (6) \nGroup Project Due: April 10 Chapter 9  \n \n\n"}